set env=%1
set app=openapi
@echo off
echo ******************************************************************************************
echo 打包发布-%env%环境
echo ******************************************************************************************

echo ******************************************************************************************
echo 开始打包parent工程(1/5)。。。
call cd %app%-parent
@echo on
call mvn clean install -Dmaven.test.skip=true -P%env%
echo 打包%app%-parent工程完毕
echo ******************************************************************************************

echo ******************************************************************************************
echo 开始打包service-client工程(2/5)...
call cd ../%app%-service-client
@echo on
call mvn clean install -Dmaven.test.skip=true -P%env%
echo 打包%app%-service-client工程完毕
echo ******************************************************************************************

echo ******************************************************************************************
echo 开始打包biz工程(3/5)...
call cd ../%app%-biz
@echo on
call mvn clean install -Dmaven.test.skip=true -P%env%
echo 打包%app%-biz工程完毕
echo ******************************************************************************************

echo ******************************************************************************************
echo 开始打包web工程(4/5)...
call cd ../%app%-web
@echo on
call mvn clean package -Dmaven.test.skip=true -P%env%
echo 打包%app%-web工程完毕
echo ******************************************************************************************

echo ******************************************************************************************
echo 开始打包monitor-service-impl工程(5/5)...
call cd ../%app%-service-impl
@echo on
call mvn clean package -Dmaven.test.skip=true -P%env%
echo 打包%app%-service-impl工程完毕
echo ******************************************************************************************

echo ******************************************************************************************
echo 打包完毕
call cd ..
echo ******************************************************************************************
rem pause